"""
بسم الله الرحمن الرحيم
في هذا المثال سوف يتم توضيح طريقة التنقل بين صفحات المنتجات
"""

from salla import Salla

store = Salla(token="TOKEN")

# تقسيم المنتجات في صفحات كل صفحة تحتوي 5 منتجات
products = store.products(per_page=5)

# طباعة رقم الصفحة الحالية
print(products.pagination.current_page)

# 👇 توجد طريقتين للتنقل بين الصفحات تم سردها ادناه

# الطريقة الاولى: عبر الميثودين التالية
# next: تعني الذهاب الى الصفحة التالية (ترجع خطأ اذ لم توجد صفحة تالية)
# previous: تعني الذهاب الى الصفحة السابقة (ترجع خطأ اذ لم توجد صفحة سابقة)
# 👇 طريقة استخدامهم

# الذهاب الى الصفحة التالية
products.next()
# طباعة رقم الصفحة الحالية
print(products.pagination.current_page)

# الذهاب الى الصفحة السابقة
products.previous()
# طباعة رقم الصفحة الحالية
print(products.pagination.current_page)

# الطريقة الثانية: عبر الميثود التالية
# page: تستقبل ارجيمنت (معطى) واحد وهو رقم الصفحة المراد الذهاب اليها
# 👇 طريقة استخدامها

products.page(2)
# طباعة رقم الصفحة الحالية
print(products.pagination.current_page)

# 🤔 هل يوجد اسهل من هذا؟
